test-results/load-test-report.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/k6/generate-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  01.0s/30s

running (0m02.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  02.0s/30s

running (0m03.0s), 5/5 VUs, 1 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  06.0s/30s

running (0m07.0s), 5/5 VUs, 14 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  09.0s/30s

running (0m10.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  10.0s/30s

running (0m11.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  11.0s/30s

running (0m12.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 44 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 48 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 68 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 73 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  19.0s/30s

running (0m20.0s), 5/5 VUs, 78 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 103 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 108 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  26.0s/30s

running (0m27.0s), 5/5 VUs, 113 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 118 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 128 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  30.0s/30s

     Γ£ù is status 200
      Γå│  4% ΓÇö Γ£ô 6 / Γ£ù 127
     Γ£ù has results
      Γå│  4% ΓÇö Γ£ô 6 / Γ£ù 127

     checks.........................: 4.51%  12 out of 266
     data_received..................: 61 kB  2.0 kB/s
     data_sent......................: 42 kB  1.4 kB/s
     http_req_blocked...............: avg=497.55┬╡s min=0s      med=0s     max=13.13ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=16.72┬╡s  min=0s      med=0s     max=556┬╡s    p(90)=0s       p(95)=0s      
   Γ£ô http_req_duration..............: avg=139.48ms min=4.15ms  med=7.49ms max=4.3s     p(90)=16.23ms  p(95)=24.99ms 
       { expected_response:true }...: avg=2.91s    min=34.91ms med=3.13s  max=4.3s     p(90)=4.14s    p(95)=4.22s   
   Γ£ù http_req_failed................: 95.48% 127 out of 133
     http_req_receiving.............: avg=354.57┬╡s min=0s      med=365┬╡s  max=1.97ms   p(90)=806.43┬╡s p(95)=969.81┬╡s
     http_req_sending...............: avg=9.31┬╡s   min=0s      med=0s     max=656.59┬╡s p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s     max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=139.11ms min=4.15ms  med=7.25ms max=4.3s     p(90)=15.36ms  p(95)=24.63ms 
     http_reqs......................: 133    4.354222/s
     iteration_duration.............: avg=1.14s    min=1s      med=1s     max=5.31s    p(90)=1.01s    p(95)=1.02s   
     iterations.....................: 133    4.354222/s
     vus............................: 5      min=5          max=5
     vus_max........................: 5      min=5          max=5


running (0m30.5s), 0/5 VUs, 133 complete and 0 interrupted iterations
constant_load Γ£ô [ 100% ] 5 VUs  30s
time="2026-03-23T16:32:34+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"